In [1]:
import numpy as np
import pandas as pd 
import matplotlib.pyplot as plt 
import seaborn as sns

In [4]:
df = pd.read_csv("E:\\Feature engineering\\Datasets\\titanic.csv",usecols = ['Age','Fare','Survived'])

In [5]:
df.head()

   Survived   Age     Fare
0         0  34.5   7.8292
1         1  47.0   7.0000
2         0  62.0   9.6875
3         0  27.0   8.6625
4         1  22.0  12.2875

In [6]:
df.isnull().sum()

Survived     0
Age         86
Fare         1
dtype: int64

In [7]:
df['Age_con'] = np.where(df['Age'].isnull() , 1 , 0)

In [8]:
df.columns

Index(['Survived', 'Age', 'Fare', 'Age_con'], dtype='object')

In [9]:
df.isnull().sum()

Survived     0
Age         86
Fare         1
Age_con      0
dtype: int64

In [10]:
df.head()

   Survived   Age     Fare  Age_con
0         0  34.5   7.8292        0
1         1  47.0   7.0000        0
2         0  62.0   9.6875        0
3         0  27.0   8.6625        0
4         1  22.0  12.2875        0